# Homework 4

# Task 1:
# написати програму, яка просить в користувача ввести через пробіл міста, в яких він був за минулі 10 років
# потім окремо запросити у користувача міста, куди він хоче поїхати внаступні 10 років
# вивести на екран повідомлення з текстом про те, що користувачу, мабуть, дуже сподобалося в містах, які він повторив в
# двох циклах вводу, а саме... (сформувати строку, використовуючи join)
# якщо повтору не було - вивести повідомлення, що користувач відкритий до чогось нового
# врахувати випадки, що користувач нічого не вводить не потрібно, в даному випадку вам явно зазначено,
# що ці перевірки не потрібні.
# не потрібно перевіряти введення цифр
# ми виходим із того, що користувач введе щось на зразок "Київ Тернопіль париЖ акапулько-80"
# В той же час врахуйте, що користувач може вводити дані в різних регістрах
# використати сети!!!

messages = {
    'visited_cities': 'Вкажіть міста, які ви відвідали за останні 10 років: ',
    'cities_to_visit': 'Вкажіть міста, які ви хотіли б відвідати в наступні 10 років: ',
    'cities_repeated': 'Мабуть вам дуже сподобались міста: {}',
    'city_repeated': 'Мабуть вам дуже сподобалось містo {}',
    'cities_different': 'Я бачу ви відкриті для нових вражень'
}
visited_cities = set(input(messages['visited_cities']).lower().title().split(' '))
cities_to_visit = set(input(messages['cities_to_visit']).lower().title().split(' '))
cities_repeated = ', '.join(visited_cities & cities_to_visit)
if len(cities_repeated) == 0:
    print(messages['cities_different'])
elif cities_repeated.count(",") == 0:
    print(messages['city_repeated'].format(cities_repeated))
else:
    print(messages['cities_repeated'].format(cities_repeated))
