# Homework 4

# Task 2:
# дано код Морзе, що зберігається в словнику
# є стрічка, в якій слова розділені 2 пробілами, а букви в слові - одним пробілом
# написати програму по декодуванню даної (чи подібної) стрічки
# ПІДКАЗКА - при потребі можна створити симетричний словник, де ключами буде код Морзе, а значеннями - символи латиниці

MORSE_CODE_DICT = {
    'A': '.-',
    'B': '-...',
    'C': '-.-.',
    'D': '-..',
    'E': '.',
    'F': '..-.',
    'G': '--.',
    'H': '....',
    'I': '..',
    'J': '.---',
    'K': '-.-',
    'L': '.-..',
    'M': '--',
    'N': '-.',
    'O': '---',
    'P': '.--.',
    'Q': '--.-',
    'R': '.-.',
    'S': '...',
    'T': '-',
    'U': '..-',
    'V': '...-',
    'W': '.--',
    'X': '-..-',
    'Y': '-.--',
    'Z': '--..',
    '1': '.----',
    '2': '..---',
    '3': '...--',
    '4': '....-',
    '5': '.....',
    '6': '-....',
    '7': '--...',
    '8': '---..',
    '9': '----.',
    '0': '-----',
    ', ': '--..--',
    '.': '.-.-.-',
    '?': '..--..',
    '/': '-..-.',
    '-': '-....-',
    '(': '-.--.',
    ')': '-.--.-'
}
DECODE_MORSE = dict()
for key, value in MORSE_CODE_DICT.items():
    DECODE_MORSE[value] = key

string_to_decode1 = '..  .-.. .. -.- .  .--. -.-- - .... --- -.  ...-- .-.-.- .---- ----- '
# string_to_decode2 = '..  -.- -. --- .-- --..--  -.-- --- ..-  -.-. .- -.  -.. ---  .. - '
# string_to_decode3 = '.. -.- -. --- .-- --..-- -.-- --- ..- -.-. .- -. -.. --- .. -____________ '

list_to_decode = string_to_decode1.split(' ')
#
for val in list_to_decode[:]:
    try:
        if val == '':
            list_to_decode[list_to_decode.index(val)] = ' '
        else:
            list_to_decode[list_to_decode.index(val)] = DECODE_MORSE[val]
    except KeyError as error:
        print(f'KeyError: Помилка в наданому коді : {error}')
        list_to_decode = []
        break
if list_to_decode:
    print('Ви отримали повідомлення: {}'.format(''.join(list_to_decode)))
